from app.func import *
filepath = 'upload/1.xlsx'
# filepath = 'upload/test.txt'

majornames=['哲学', '经济学', '金融学', '国际经济与贸易', '法学', '知识产权', '社会学', '社会工作', '思想政治教育', '汉语言文学', '汉语言', '汉语国际教育', '英语', '日语', '新闻学', '广播电视学', '广告学', '网络与新媒体', '历史学', '数学与应用数学', '信息与计算科学', '应用物理学', '应用化学', '理论与应用力学', '机械工程', '机械设计制造及其自动化', '机械电子工程', '工业设计', '智能制造工程', '测控技术与仪器', '材料物理', '冶金工程', '金属材料工程', '无机非金属材料工程', '高分子材料与工程', '材料设计科学与工程', '电气工程及其自动化', '电子信息工程', '电子科学与技术', '通信工程', '微电子科学与工程', '光电信息科学与工程', '电子信息科学与技术', '自动化', '计算机科学与技术', '数字媒体技术', '智能科学与技术', '网络空间安全', '电影制作', '土木工程', '化学工程与工艺', '包装工程', '环境工程', '生物医学工程', '食品科学与工程', '建筑学', '城乡规划', '生物工程', '管理科学', '信息管理与信息系统', '工程管理', '工商管理', '会计学', '财务管理', '人力资源管理', '档案学', '信息资源管理', '物流管理', '工业工程', '音乐表演', '音乐学', '表演', '戏剧影视文学', '广播电视编导', '戏剧影视导演', '戏剧影视美术设计', '动画', '影视摄影与制作', '美术学', '绘画', '雕塑', '中国画', '视觉传达设计', '环境设计', '数字媒体艺术', '艺术与科技']
majornums=['010101', '020101', '020301K', '020401', '030101K', '030102T', '030301', '030302', '030503', '050101', '050102', '050103', '050201', '050207', '050301', '050302', '050303', '050306T', '060101', '070101', '070102', '070202', '070302', '080101', '080201', '080202', '080204', '080205', '080213T', '080301', '080402', '080404', '080405', '080406', '080407', '080415T', '080601', '080701', '080702', '080703', '080704', '080705', '080714T', '080801', '080901', '080906', '080907T', '080911TK', '080913T', '081001', '081301', '081702', '082502', '082601', '082701', '082801', '082802', '083001', '120101', '120102', '120103', '120201K', '120203K', '120204', '120206', '120502', '120503', '120601', '120701', '130201', '130202', '130301', '130304', '130305', '130306', '130307', '130310', '130311T', '130401', '130402', '130403', '130406T', '130502', '130503', '130508', '130509T']

print(majorname2majornum('计算机科学与技术'))
print(deptname2deptnum('计算机工程与科学学院'))
print(load_student_from_file(filepath))
